# Problem Statement

1. Load the Academic Performance dataset in data frame object.

2. Check null values in the dataset.

3. Check missing values in dataset and replace the null values with standard null value NaN

4. Replace the missing value of Math Score with Mean Value

5. Replace the missing value of Reading Score with standard deviation

6. Replace the missing value of place with common value "Nashik"

In [1]:
import numpy as np
import pandas as pd

C:\Users\OM\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
df=pd.read_csv(r"C:\Users\OM\Downloads\StudentsPerformanceTest1.csv")

In [3]:
df.head()

,gender,math score,reading score,writing score,Placement Score,placement offer count,Region
0,female,72,72,74.0,78.0,1,Pune
1,female,69,90,88.0,NaN,2,na
2,female,90,95,93.0,74.0,2,Nashik
3,male,47,57,NaN,78.0,1,Na
4,male,na,78,75.0,81.0,3,Pune

In [4]:
df.tail()

,gender,math score,reading score,writing score,Placement Score,placement offer count,Region
4,male,na,78,75.0,81.0,3,Pune
5,female,71,Na,78.0,70.0,4,na
6,male,12,44,52.0,12.0,2,Nashik
7,male,NaN,65,67.0,49.0,1,Pune
8,male,5,77,89.0,55.0,0,NaN

In [5]:
df.shape

(9, 7)

In [11]:
df.columns

Index(['gender', 'math score', 'reading score', 'writing score',
       'Placement Score', 'placement offer count', 'Region'],
      dtype='object')

In [6]:
df.ndim

2

In [7]:
df.dtypes

gender                    object
math score                object
reading score             object
writing score            float64
Placement Score          float64
placement offer count      int64
Region                    object
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 9 non-null      object
 1   math score             8 non-null      object
 2   reading score          9 non-null      object
 3   writing score          8 non-null      float64
 4   Placement Score        8 non-null      float64
 5   placement offer count  9 non-null      int64
 6   Region                 8 non-null      object
dtypes: float64(2), int64(1), object(4)
memory usage: 636.0+ bytes

In [9]:
df.isnull().sum()

gender                   0
math score               1
reading score            0
writing score            1
Placement Score          1
placement offer count    0
Region                   1
dtype: int64

In [10]:
df.isna().sum()

gender                   0
math score               1
reading score            0
writing score            1
Placement Score          1
placement offer count    0
Region                   1
dtype: int64

In [12]:
# Check for null values in the dataset
print("Null values in the dataset:")
print(df.isnull().sum())

Null values in the dataset:
gender                   0
math score               1
reading score            0
writing score            1
Placement Score          1
placement offer count    0
Region                   1
dtype: int64

In [15]:
# Replace missing values in dataset with standard null value NaN
df.replace("", float("NaN"), inplace=True)
df.replace("na", float("NaN"), inplace=True)
df

,gender,math score,reading score,writing score,Placement Score,placement offer count,Region
0,female,72,72,74.0,78.0,1,Pune
1,female,69,90,88.0,NaN,2,NaN
2,female,90,95,93.0,74.0,2,Nashik
3,male,47,57,NaN,78.0,1,Na
4,male,NaN,78,75.0,81.0,3,Pune
5,female,71,Na,78.0,70.0,4,NaN
6,male,12,44,52.0,12.0,2,Nashik
7,male,NaN,65,67.0,49.0,1,Pune
8,male,5,77,89.0,55.0,0,NaN

In [16]:
# Replace the missing value of Math Score with Mean Value
df['math score'] = pd.to_numeric(df['math score'], errors='coerce')
math_mean = df['math score'].mean()
df['math score'].fillna(math_mean, inplace=True)

C:\Users\OM\AppData\Local\Temp\ipykernel_7256\468742409.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['math score'].fillna(math_mean, inplace=True)

In [17]:
df['math score']

0    72.000000
1    69.000000
2    90.000000
3    47.000000
4    52.285714
5    71.000000
6    12.000000
7    52.285714
8     5.000000
Name: math score, dtype: float64

In [19]:
# Convert 'reading score' column to numeric, coerce errors to NaN
df['reading score'] = pd.to_numeric(df['reading score'], errors='coerce')
# Replace the missing value of Reading Score with standard deviation
reading_std = df['reading score'].std()
df['reading score'].fillna(reading_std, inplace=True)

C:\Users\OM\AppData\Local\Temp\ipykernel_7256\1840821010.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['reading score'].fillna(reading_std, inplace=True)

In [20]:
df['reading score']

0    72.000000
1    90.000000
2    95.000000
3    57.000000
4    78.000000
5    16.782218
6    44.000000
7    65.000000
8    77.000000
Name: reading score, dtype: float64

In [26]:
df['Region'].replace(("Na","NaN"), inplace=True)

C:\Users\OM\AppData\Local\Temp\ipykernel_7256\4081624157.py:1: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df['Region'].replace(("Na","NaN"), inplace=True)

In [27]:
# Replace the missing value of place with common value "Nashik"
df['Region'].fillna("Nashik", inplace=True)

In [28]:
df['Region']

0      Pune
1    Nashik
2    Nashik
3    Nashik
4      Pune
5    Nashik
6    Nashik
7      Pune
8    Nashik
Name: Region, dtype: object

In [29]:
# Check for null values in the dataset after replacement
print("\nNull values in the dataset after replacement:")
print(df.isnull().sum())

Null values in the dataset after replacement:
gender                   0
math score               0
reading score            0
writing score            1
Placement Score          1
placement offer count    0
Region                   0
dtype: int64

In [32]:
df=df.fillna(0)
df

,gender,math score,reading score,writing score,Placement Score,placement offer count,Region
0,female,72.000000,72.000000,74.0,78.0,1,Pune
1,female,69.000000,90.000000,88.0,0.0,2,Nashik
2,female,90.000000,95.000000,93.0,74.0,2,Nashik
3,male,47.000000,57.000000,0.0,78.0,1,Nashik
4,male,52.285714,78.000000,75.0,81.0,3,Pune
5,female,71.000000,16.782218,78.0,70.0,4,Nashik
6,male,12.000000,44.000000,52.0,12.0,2,Nashik
7,male,52.285714,65.000000,67.0,49.0,1,Pune
8,male,5.000000,77.000000,89.0,55.0,0,Nashik

In [33]:
print(df.isnull().sum())

gender                   0
math score               0
reading score            0
writing score            0
Placement Score          0
placement offer count    0
Region                   0
dtype: int64

In [34]:
# Preview the updated DataFrame
print("\nUpdated DataFrame:")
print(df)

Updated DataFrame:
   gender  math score  reading score  writing score  Placement Score  \
0  female   72.000000      72.000000           74.0             78.0
1  female   69.000000      90.000000           88.0              0.0
2  female   90.000000      95.000000           93.0             74.0
3    male   47.000000      57.000000            0.0             78.0
4    male   52.285714      78.000000           75.0             81.0
5  female   71.000000      16.782218           78.0             70.0
6    male   12.000000      44.000000           52.0             12.0
7    male   52.285714      65.000000           67.0             49.0
8    male    5.000000      77.000000           89.0             55.0

   placement offer count  Region
0                      1    Pune
1                      2  Nashik
2                      2  Nashik
3                      1  Nashik
4                      3    Pune
5                      4  Nashik
6                      2  Nashik
7                      1    Pune
8                      0  Nashik